 # Data Frame

In [2]:
import pandas as pd

list = [1,2,3,4,5,6]

var = pd.DataFrame(list)

print(var)

   0
0  1
1  2
2  3
3  4
4  5
5  6

In [6]:
#using Dictionary

dic = {
    "add":[1,2,3,4,5,6],
    "subtract":[4,3,5,6,7,8] #number of elemnts in both should be equal
}

var = pd.DataFrame(dic)
print(var)

   add  subtract
0    1         4
1    2         3
2    3         5
3    4         6
4    5         7
5    6         8

access one column

In [8]:
dic = {
    "add":[1,2,3,4,5,6],
    "subtract":[4,3,5,6,7,8], #number of elemnts in both should be equal
    "multiply":[4,5,6,7,8,9]
}

var = pd.DataFrame(dic, columns = ["subtract"])
print(var)

   subtract
0         4
1         3
2         5
3         6
4         7
5         8

access particular element

In [11]:
dic = {
    "add":[1,2,3,4,5,6],
    "subtract":[4,3,5,6,7,8], #number of elemnts in both should be equal
    "multiply":[4,5,6,7,8,9]
}

var = pd.DataFrame(dic)
print(var)
print()
print("add ka 3 index elemt : ",var["add"][3])

   add  subtract  multiply
0    1         4         4
1    2         3         5
2    3         5         6
3    4         6         7
4    5         7         8
5    6         8         9

add ka 3 index elemt :  4

In [15]:
list1 = [[1,2,3,4,5,6],[11,12,13,14,15,16]]

var2 = pd.DataFrame(list1)
print(var2)
print()

#access any particular

#print(var[1,1])

    0   1   2   3   4   5
0   1   2   3   4   5   6
1  11  12  13  14  15  16

2 seires se ek DataFrame

In [16]:
sr = {
    "s":pd.Series([1,2,3,4]),
    "r":pd.Series([2,4,5,6])
}

var3 = pd.DataFrame(sr)
print(var3)

   s  r
0  1  2
1  2  4
2  3  5
3  4  6

# Merging and Concating

In [5]:
import pandas as pd

sr = pd.DataFrame({
    "s":([1,2,3,4]),
    "r":([2,4,5,6])
})

sr1 = pd.DataFrame({
    "s":([1,2,3,4]),
    "t":([22,24,25,26])
}
)
pd.merge(sr, sr1, on = "s" ) #s is the common

   s  r   t
0  1  2  22
1  2  4  24
2  3  5  25
3  4  6  26

In [6]:
sr = pd.DataFrame({
    "s":([1,2,3,4]),
    "r":([2,4,5,6])
})

sr1 = pd.DataFrame({
    "s":([1,2,3,4]),
    "t":([22,24,25,26])
}
)
pd.merge(sr1, sr, on = "s" ) #to change the order of merging

   s   t  r
0  1  22  2
1  2  24  4
2  3  25  5
3  4  26  6

In [8]:
sr = pd.DataFrame({
    "s":([1,2,3,4]),
    "r":([2,4,5,6])
})

sr1 = pd.DataFrame({
    "s":([1,2,3,5]),
    "t":([22,24,25,26])
}
)
pd.merge(sr, sr1, on = "s" ) #last element of s is different

   s  r   t
0  1  2  22
1  2  4  24
2  3  5  25

'How' paramter {inner, left, right, outer}

In [9]:
sr = pd.DataFrame({
    "s":([1,2,3,4]),
    "r":([2,4,5,6])
})

sr1 = pd.DataFrame({
    "s":([1,2,3,5]),
    "t":([22,24,25,26])
}
)
pd.merge(sr, sr1, how = "outer" ) #last element of s is different

   s    r     t
0  1  2.0  22.0
1  2  4.0  24.0
2  3  5.0  25.0
3  4  6.0   NaN
4  5  NaN  26.0

indicator parameter

In [10]:
sr = pd.DataFrame({
    "s":([1,2,3,4]),
    "r":([2,4,5,6])
})

sr1 = pd.DataFrame({
    "s":([1,2,3,5]),
    "t":([22,24,25,26])
}
)
pd.merge(sr, sr1, how = "outer", indicator = True) #last element of s is different

   s    r     t      _merge
0  1  2.0  22.0        both
1  2  4.0  24.0        both
2  3  5.0  25.0        both
3  4  6.0   NaN   left_only
4  5  NaN  26.0  right_only

left right index parameter

In [13]:
sr = pd.DataFrame({
    "S":([1,2,3,4]),
    "R":([2,4,5,6])
})

sr1 = pd.DataFrame({
    "S":([1,2,3,5]),
    "R":([22,24,25,26])  #if name of both list is same
}
)
pd.merge(sr, sr1, left_index=True, right_index=True) #to show the complete data

   S_x  R_x  S_y  R_y
0    1    2    1   22
1    2    4    2   24
2    3    5    3   25
3    4    6    5   26

Suffix paramter

In [15]:
sr = pd.DataFrame({
    "S":([1,2,3,4]),
    "R":([2,4,5,6])
})

sr1 = pd.DataFrame({
    "S":([1,2,3,5]),
    "R":([22,24,25,26])  #if name of both list is same
}
)
pd.merge(sr, sr1, left_index=True, right_index=True, suffixes = ("_name", "_python")) #change the name of list

   S_name  R_name  S_python  R_python
0       1       2         1        22
1       2       4         2        24
2       3       5         3        25
3       4       6         5        26

# Concate

In [19]:
sr1 = pd.Series([1,2,3,4,5,4,5,6,5])
sr2 = pd.Series([12,22,3,34,55])

pd.concat([sr1, sr2] )

0     1
1     2
2     3
3     4
4     5
5     4
6     5
7     6
8     5
0    12
1    22
2     3
3    34
4    55
dtype: int64

In [21]:
#concate in data frame : row wise

sr = pd.DataFrame({
    "S":([1,2,3,4]),
    "R":([2,4,5,6])
})

sr1 = pd.DataFrame({
    "S":([1,2,3,5]),
    "R":([22,24,25,26])
}
)
pd.concat([sr, sr1])

   S   R
0  1   2
1  2   4
2  3   5
3  4   6
0  1  22
1  2  24
2  3  25
3  5  26

In [23]:
#concate in data frame : column wise

sr = pd.DataFrame({
    "S":([1,2,3,4]),
    "T":([2,4,5,6])
})

sr1 = pd.DataFrame({
    "U":([1,2,3,5]),
    "V":([22,24,25,26])
}
)
pd.concat([sr, sr1], axis = 1 #no need to have common name
)

   S  T  U   V
0  1  2  1  22
1  2  4  2  24
2  3  5  3  25
3  4  6  5  26

Join paramter, 'outer' = union, 'inner' = intersection

In [30]:
sr = pd.DataFrame({
    "S":([1,2,3,4]),
    "T":([2,4,5,6])
})

sr1 = pd.DataFrame({
    "U":([1,2]),
    "V":([22,24])
}
)
pd.concat([sr, sr1], axis = 1, join="outer") #no need to have common name

   S  T    U     V
0  1  2  1.0  22.0
1  2  4  2.0  24.0
2  3  5  NaN   NaN
3  4  6  NaN   NaN

In [31]:
sr = pd.DataFrame({
    "S":([1,2,3,4]),
    "T":([2,4,5,6])
})

sr1 = pd.DataFrame({
    "U":([1,2]),
    "V":([22,24])
}
)
pd.concat([sr, sr1], axis = 1, join="inner") #no need to have common name

   S  T  U   V
0  1  2  1  22
1  2  4  2  24

Key paramter

In [33]:
sr = pd.DataFrame({
    "S":([1,2,3,4]),
    "T":([2,4,5,6])
})

sr1 = pd.DataFrame({
    "U":([1,2]),
    "V":([22,24])
}
)
pd.concat([sr, sr1], axis = 1, keys = ["d1", "d2"])

  d1      d2
   S  T    U     V
0  1  2  1.0  22.0
1  2  4  2.0  24.0
2  3  5  NaN   NaN
3  4  6  NaN   NaN

concate 1D & 2D dataframe

In [34]:
sr = pd.DataFrame({
    "S":([1,2,3,4])
    
})

sr1 = pd.DataFrame({
    "U":([1,2]),
    "V":([22,24])
}
)
pd.concat([sr, sr1])

     S    U     V
0  1.0  NaN   NaN
1  2.0  NaN   NaN
2  3.0  NaN   NaN
3  4.0  NaN   NaN
0  NaN  1.0  22.0
1  NaN  2.0  24.0

# Join and Append

In [38]:
var1 = pd.DataFrame({
    "A":[1,2,3,4],
    "B":[11,12,13,14]
})
var2 = pd.DataFrame({
    "C":[10,20],
    "D":[11,22]
})

var1.join(var2)

   A   B     C     D
0  1  11  10.0  11.0
1  2  12  20.0  22.0
2  3  13   NaN   NaN
3  4  14   NaN   NaN

In [43]:
#change index type/number

var1 = pd.DataFrame({
    "A":[1,2,3,4],
    "B":[11,12,13,14],
},
    index = ["a","b","c","d"]
)

var2 = pd.DataFrame({
    "C":[10,20],
    "D":[11,22]
},
    index = ["a","b"]
)

var1.join(var2)

   A   B     C     D
a  1  11  10.0  11.0
b  2  12  20.0  22.0
c  3  13   NaN   NaN
d  4  14   NaN   NaN

In [44]:
var1 = pd.DataFrame({
    "A":[1,2,3,4],
    "B":[11,12,13,14]
})
var2 = pd.DataFrame({
    "C":[10,20],
    "D":[11,22]
})

var2.join(var1, how = "outer") #in reverse order, 'how' to include all values

      C     D  A   B
0  10.0  11.0  1  11
1  20.0  22.0  2  12
2   NaN   NaN  3  13
3   NaN   NaN  4  14

# Append

In [45]:
var1 = pd.DataFrame({
    "A":[1,2,3,4],
    "B":[11,12,13,14]
})
var2 = pd.DataFrame({
    "C":[10,20],
    "D":[11,22]
})

var1.append(var2)

AttributeError: 'DataFrame' object has no attribute 'append'